app/controllers/example_controller.rb

  def form9
    @article = Article.find_or_create_by_title("Existing record") do |a|
---
INSERT INTO "articles" ("updated_at", "title", "body", "tags", "published_at", "created_at") VALUES('2009-06-23 11:57:40', 'Please choose a title...', NULL, '---
SELECT * FROM "articles" WHERE ("articles"."title" = 'Existing record') LIMIT 1